<h1>Artificial Intelligence Continous Assessment</h1>

<h2>Imports</h2>

In [24]:
import pandas as pd
import numpy as np

from seaborn import lmplot, stripplot

from sklearn.model_selection import train_test_split
from pandas.plotting import scatter_matrix

from seaborn import scatterplot, heatmap

from sklearn.compose import ColumnTransformer
from sklearn.pipeline import Pipeline

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import OneHotEncoder

from sklearn.base import BaseEstimator, TransformerMixin

from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier

from sklearn.model_selection import GridSearchCV

from sklearn.metrics import accuracy_score

<h2>Dataset Analysis (First look)</h2>

In [25]:
# Reading the salaries dataset from csv
df = pd.read_csv("data_salaries.csv")

In [26]:
# Information about the dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62642 entries, 0 to 62641
Data columns (total 17 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   timestamp                62642 non-null  object
 1   company                  62637 non-null  object
 2   level                    62527 non-null  object
 3   title                    62642 non-null  object
 4   totalyearlycompensation  62642 non-null  int64
 5   location                 62642 non-null  object
 6   yearsofexperience        62642 non-null  int64
 7   yearsatcompany           62642 non-null  int64
 8   tag                      61788 non-null  object
 9   basesalary               62642 non-null  int64
 10  stockgrantvalue          62642 non-null  int64
 11  bonus                    62642 non-null  int64
 12  gender                   43102 non-null  object
 13  otherdetails             40139 non-null  object
 14  cityid                   62642 non-null  int64
 15  dmaid                    62640 non-null  float64
 16  rowNumber                62642 non-null  int64
dtypes: float64(1), int64(8), object(8)
memory usage: 8.1+ MB

In [27]:
# Summary of stats
df.describe(include="all")

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,stockgrantvalue,bonus,gender,otherdetails,cityid,dmaid,rowNumber
count,62642,62637,62527,62642,6.264200e+04,62642,62642.000000,62642.000000,61788,6.264200e+04,6.264200e+04,62642.000000,43102,40139,62642.000000,62640.000000,62642.000000
unique,62561,1869,3071,15,NaN,1050,NaN,NaN,3271,NaN,NaN,NaN,4,40132,NaN,NaN,NaN
top,2/25/2020 13:25:07,Amazon,L4,Software Engineer,NaN,"Seattle, WA",NaN,NaN,Full Stack,NaN,NaN,NaN,Male,cyclieuns,NaN,NaN,NaN
freq,3,8054,5008,41231,NaN,8701,NaN,NaN,11382,NaN,NaN,NaN,35702,2,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,3.175327e+03,NaN,7.191054,2.700616,NaN,1.798145e+03,1.134865e+03,242.317199,NaN,NaN,9856.201989,616.097222,41694.723732
std,NaN,NaN,NaN,NaN,3.877877e+04,NaN,6.437148,3.524030,NaN,1.927194e+04,2.520611e+04,3709.187697,NaN,NaN,6679.104563,289.843390,24488.865879
min,NaN,NaN,NaN,NaN,0.000000e+00,NaN,0.000000,0.000000,NaN,0.000000e+00,0.000000e+00,0.000000,NaN,NaN,0.000000,0.000000,1.000000
25%,NaN,NaN,NaN,NaN,1.160000e+02,NaN,3.000000,0.000000,NaN,8.800000e+01,0.000000e+00,1.000000,NaN,NaN,7369.000000,506.000000,20069.250000
50%,NaN,NaN,NaN,NaN,1.830000e+02,NaN,6.000000,1.000000,NaN,1.310000e+02,2.300000e+01,13.000000,NaN,NaN,7839.000000,807.000000,42019.000000
75%,NaN,NaN,NaN,NaN,2.690000e+02,NaN,10.000000,4.000000,NaN,1.810000e+02,6.400000e+01,27.000000,NaN,NaN,11521.000000,807.000000,63021.750000
max,NaN,NaN,NaN,NaN,3.386013e+06,NaN,90.000000,90.000000,NaN,2.057772e+06,3.140803e+06,384026.000000,NaN,NaN,47926.000000,881.000000,83875.000000

In [28]:
df.head()

,timestamp,company,level,title,totalyearlycompensation,location,yearsofexperience,yearsatcompany,tag,basesalary,stockgrantvalue,bonus,gender,otherdetails,cityid,dmaid,rowNumber
0,6/7/2017 11:33:27,Oracle,L3,Product Manager,186,"Redwood City, CA",1,1,NaN,160,17,9,NaN,NaN,7392,807.0,1
1,6/10/2017 17:11:29,eBay,SE 2,Software Engineer,0,"San Francisco, CA",3,4,NaN,0,0,0,NaN,NaN,7419,807.0,2
2,6/11/2017 14:53:57,Amazon,L7,Product Manager,126,"Seattle, WA",10,0,NaN,126,0,0,NaN,NaN,11527,819.0,3
3,6/14/2017 21:22:25,Microsoft,64,Software Engineering Manager,171348,"Redmond, WA",13,13,NaN,92799,55371,23178,NaN,NaN,11521,819.0,5
4,6/16/2017 10:44:01,Amazon,L5,Software Engineer,214175,"Vancouver, BC, Canada",13,1,NaN,156335,0,57840,NaN,NaN,1320,0.0,6

<h3>Observations</h3>
<p>
    There are 62642 entries in the dataset. <br>
    <b>Timestamp: </b>Timestamps has 62561 unique values that are nominal.<br>
    <b>Level: </b>Out of 3071 levels of education, L4 is the overwhelming majority.<br>
    <b>Title: </b>There are only 15 different occupations. Majority of entries are Software Engineers making up 66% of the total.<br>
    <b>Company: </b>There are 1869 companies. Amazon hires the most amount of employees, 8054.<br>
    <b>Location: </b>There are 8701 workers that live in Seattle. Amazon is possibly the main contributor to this given their headquarters is located there.<br>
    <b>Tag: </b>Out of 3271 tags, Full Stack is the overwhelming majority.<br>
    <b>Gender: </b>4 unique values for gender. Besides, male, female and other, there must lots of empty values as shown in the head.<br>
    <b>Other Details: </b>All the details blocks either contain jibberish or are completely empty<br>
    <br>
    <b>Base Salary: </b>The minimum value is 0. Possibly an error<br>
</p>

<h2>Data Cleaning</h2>

In [ ]:
# Shuffle the dataset
df = df.sample(frac=1, random_state=2)
df.reset_index(drop=True, inplace=True)

<h2>Data Testing</h2>